uTasker/uTasker-Kinetis/Applications/uTaskerSerialBoot/app_hw_kinetis.h
    #define WRITE_PROTECT_INPUT    PORTE_BIT27
    #if defined SD_CONTROLLER_AVAILABLE                                  // use SDHC controller rather than SPI
        #define SET_SD_CS_HIGH()
        #define SET_SD_CS_LOW()
        #ifdef _WINDOWS
            #define POWER_UP_SD_CARD()  _CONFIG_DRIVE_PORT_OUTPUT_VALUE(E, PORTE_BIT6, 0, (PORT_SRE_SLOW | PORT_DSE_LOW)); _CONFIG_PORT_INPUT(E, (WRITE_PROTECT_INPUT), (PORT_PS_UP_ENABLE)); SDHC_SYSCTL |= SDHC_SYSCTL_INITA; SDHC_SYSCTL &= ~SDHC_SYSCTL_INITA; // apply power to the SD card if appropriate (we use this to send 80 clocks - self-clearing bit)
        #else
            #define POWER_UP_SD_CARD()  _CONFIG_DRIVE_PORT_OUTPUT_VALUE(E, PORTE_BIT6, 0, (PORT_SRE_SLOW | PORT_DSE_LOW)); _CONFIG_PORT_INPUT(E, (WRITE_PROTECT_INPUT), (PORT_PS_UP_ENABLE)); SDHC_SYSCTL |= SDHC_SYSCTL_INITA; while (SDHC_SYSCTL & SDHC_SYSCTL_INITA) {}; // apply power to the SD card if appropriate (we use this to send 80 clocks)
        #endif
        #define SDHC_SYSCTL_SPEED_SLOW        (SDHC_SYSCTL_SDCLKFS_128 | SDHC_SYSCTL_DVS_2)  // 390kHz when 100MHz clock
        #define SDHC_SYSCTL_SPEED_FAST        (SDHC_SYSCTL_SDCLKFS_2 | SDHC_SYSCTL_DVS_2)    // 25MHz when 100MHz clock
        #define SET_SPI_SD_INTERFACE_FULL_SPEED() fnSetSD_clock(SDHC_SYSCTL_SPEED_FAST); SDHC_PROCTL |= SDHC_PROCTL_DTW_4BIT
    #else
        // Configure to suit SD card SPI mode at between 100k and 400k
        //
        #define SPI_CS1_0                  PORTD_BIT15
        #define INITIALISE_SPI_SD_INTERFACE() POWER_UP(6, SIM_SCGC6_SPI1); \
        _CONFIG_PORT_INPUT(E, (WRITE_PROTECT_INPUT), (PORT_PS_UP_ENABLE)); \
        _CONFIG_PORT_INPUT(E, (PORTE_BIT0), (PORT_NO_PULL)); \
        _CONFIG_PERIPHERAL(E, 2, PE_2_SPI1_SCK); _CONFIG_PERIPHERAL(E, 1, (PE_1_SPI1_SOUT | PORT_SRE_FAST | PORT_DSE_HIGH)); _CONFIG_PERIPHERAL(E, 3, (PE_3_SPI1_SIN | PORT_PS_UP_ENABLE)); \
        _CONFIG_DRIVE_PORT_OUTPUT_VALUE(D, SPI_CS1_0, SPI_CS1_0, (PORT_SRE_FAST | PORT_DSE_HIGH)); \
        SPI1_CTAR0 = (SPI_CTAR_ASC_6 | SPI_CTAR_FMSZ_8 | SPI_CTAR_CPHA | SPI_CTAR_CPOL | SPI_CTAR_BR_128); SPI1_MCR = (SPI_MCR_DIS_TXF | SPI_MCR_DIS_RXF | SPI_MCR_MSTR | SPI_MCR_DCONF_SPI | SPI_MCR_CLR_RXF | SPI_MCR_CLR_TXF | SPI_MCR_PCSIS_CS0 | SPI_MCR_PCSIS_CS1 | SPI_MCR_PCSIS_CS2 | SPI_MCR_PCSIS_CS3 | SPI_MCR_PCSIS_CS4 | SPI_MCR_PCSIS_CS5)

        #define ENABLE_SPI_SD_OPERATION()
        #define SET_SD_CARD_MODE()

        // Set maximum speed
        //
        #define SET_SPI_SD_INTERFACE_FULL_SPEED() SPI1_MCR |= SPI_MCR_HALT; SPI1_CTAR0 = (SPI_CTAR_FMSZ_8 | SPI_CTAR_CPOL | SPI_CTAR_CPHA | SPI_CTAR_BR_2); SPI1_MCR &= ~SPI_MCR_HALT;
        #ifdef _WINDOWS
            #define WRITE_SPI_CMD(byte)     SPI1_SR &= ~(SPI_SR_RFDF); SPI1_PUSHR = (byte | SPI_PUSHR_PCS_NONE | SPI_PUSHR_CTAS_CTAR0); SPI1_POPR = _fnSimSD_write((unsigned char)byte)
            #define WAIT_TRANSMISSON_END() while (!(SPI1_SR & (SPI_SR_RFDF))) { SPI1_SR |= (SPI_SR_RFDF); }
            #define READ_SPI_DATA()        (unsigned char)SPI1_POPR
        #else
            #define WRITE_SPI_CMD(byte)    SPI1_SR = (SPI_SR_RFDF); SPI1_PUSHR = (byte | SPI_PUSHR_PCS_NONE | SPI_PUSHR_CTAS_CTAR0) // clear flags before transmitting (and receiving) a single byte
            #define WAIT_TRANSMISSON_END() while (!(SPI1_SR & (SPI_SR_RFDF))) {}
            #define READ_SPI_DATA()        (unsigned char)SPI1_POPR
        #endif
        #define SET_SD_DI_CS_HIGH()  _SETBITS(D, SPI_CS1_0)              // force DI and CS lines high ready for the initialisation sequence
        #define SET_SD_CS_LOW()      _CLEARBITS(D, SPI_CS1_0)            // assert the CS line of the SD card to be read
        #define SET_SD_CS_HIGH()     _SETBITS(D, SPI_CS1_0)              // negate the CS line of the SD card to be read
        #define POWER_UP_SD_CARD()   _CONFIG_DRIVE_PORT_OUTPUT_VALUE(E, PORTE_BIT6, 0, (PORT_SRE_SLOW | PORT_DSE_LOW)); // apply power to the SD card if appropriate
    #endif
    #define POWER_DOWN_SD_CARD()     _SETBITS(E, PORTE_BIT6)             // remove power from SD card interface
    #define GET_SDCARD_WP_STATE()   (_READ_PORT_MASK(E, WRITE_PROTECT_INPUT) == 0) // when the input is read as '0' the card is protected from writes


    #define QS_3TO0_FREESCALE_LOGO           0x00001000
    #define QS_3TO0_CONNECTION_SYMBOL        0x00000100
    #define QS_3TO0_USB_SYMBOL               0x00000200
    #define QS_3TO0_CLOCK_SYMBOL             0x00000800
    #define QS_3TO0_JLINK_SYMBOL             0x00002000
    #define QS_3TO0_BATTERY_SYMBOL           0x00004000
    #define QS_3TO0_BATTERY_CHARGE_3         0x00008000

    #define QS_39TO36_POUNCE_LOGO            0x20000000
    #define QS_39TO36_BATTERY_CHARGE_2       0x40000000
    #define QS_39TO36_BATTERY_CHARGE_1       0x80000000


    #define OWN_SD_CARD_DISPLAY                                          // override defaults
    #define _DISPLAY_SD_CARD_NOT_PRESENT()   SET_SLCD(39TO36, QS_39TO36_POUNCE_LOGO)
    #define _DISPLAY_SD_CARD_NOT_FORMATTED() SET_SLCD(3TO0,   QS_3TO0_JLINK_SYMBOL)
    #define _DISPLAY_NO_FILE()               SET_SLCD(3TO0,   QS_3TO0_CONNECTION_SYMBOL)
    #define _DISPLAY_SD_CARD_PRESENT()       SET_SLCD(3TO0,   QS_3TO0_BATTERY_SYMBOL)
    #define _DISPLAY_VALID_CONTENT()         SET_SLCD(39TO36, QS_39TO36_BATTERY_CHARGE_1)
    #define _DISPLAY_INVALID_CONTENT()       SET_SLCD(3TO0,   QS_3TO0_BATTERY_CHARGE_3)
    #define _DISPLAY_SW_OK()                 SET_SLCD(39TO36, QS_39TO36_BATTERY_CHARGE_2); SET_SLCD(3TO0, QS_3TO0_BATTERY_CHARGE_3)
    #define _DISPLAY_SW_UPDATED()            SET_SLCD(39TO36, QS_39TO36_BATTERY_CHARGE_2); SET_SLCD(3TO0, QS_3TO0_BATTERY_CHARGE_3)
    #define _DISPLAY_ERROR()                 SET_SLCD(3TO0,   QS_3TO0_CLOCK_SYMBOL)
    #define _DISPLAY_OVERSIZE_CONTENT()      SET_SLCD(3TO0,   (QS_3TO0_CLOCK_SYMBOL | QS_3TO0_JLINK_SYMBOL))
#elif defined TWR_K40X256 || defined TWR_K53N512 || defined TWR_K40D100M
    #define SD_CONTROLLER_AVAILABLE                                      // user SDHC controller instead of SPI interface

