uTasker/uTasker-Kinetis/Applications/uTaskerSerialBoot/app_hw_kinetis.h
    #define SDCARD_DETECT          (PORTA_BIT11)                         // if the port is changed (eg. A to B) the port macros will require appropriate adjustment too

    #define BLINK_LED              GREEN_LED

    #if defined SDCARD_SUPPORT || defined SPI_FLASH_FAT
        #define INIT_WATCHDOG_LED() _CONFIG_DRIVE_PORT_OUTPUT_VALUE(A, (BLINK_LED), (BLINK_LED), (PORT_SRE_SLOW | PORT_DSE_HIGH)); _CONFIG_PORT_INPUT(A, (SWITCH_1 | SDCARD_DETECT), PORT_PS_UP_ENABLE); // note that the force boot input is configured here and not with the INIT_WATCHDOG_DISABLE() since the watchdog must be disabled as quickly as possible
    #else
        #define INIT_WATCHDOG_LED() _CONFIG_DRIVE_PORT_OUTPUT_VALUE(A, (BLINK_LED), (BLINK_LED), (PORT_SRE_SLOW | PORT_DSE_HIGH)); _CONFIG_PORT_INPUT(A, SWITCH_1, PORT_PS_UP_ENABLE); // note that the force boot input is configured here and not with the INIT_WATCHDOG_DISABLE() since the watchdog must be disabled as quickly as possible
    #endif

    #define INIT_WATCHDOG_DISABLE() 
    #define WATCHDOG_DISABLE()     1                                     // never disable the watchdog
    #define TOGGLE_WATCHDOG_LED()  _TOGGLE_PORT(A, BLINK_LED)

    #if defined SDCARD_SUPPORT || defined SPI_FLASH_FAT
        #define FORCE_BOOT()       ((_READ_PORT_MASK(A, SWITCH_1) == 0) || (_READ_PORT_MASK(A, SDCARD_DETECT) == 0)) // hold SW1 at reset or with inserted SD card
    #else
        #define FORCE_BOOT()       (_READ_PORT_MASK(A, SWITCH_1) == 0)   // pull this input down to force boot loader mode (hold SW1 at reset)
    #endif
    #define RETAIN_LOADER_MODE()   (_READ_PORT_MASK(A, SWITCH_1) == 0)

    #define SD_CONTROLLER_AVAILABLE                                      // use SDHC controller rather than SPI
    #define WRITE_PROTECT_INPUT     0
    #define SET_SD_CS_HIGH()
    #define SET_SD_CS_LOW()
    #ifdef _WINDOWS
        #define POWER_UP_SD_CARD() _CONFIG_PORT_INPUT(A, (SDCARD_DETECT), (PORT_PS_UP_ENABLE)); SDHC_SYSCTL |= SDHC_SYSCTL_INITA; SDHC_SYSCTL &= ~SDHC_SYSCTL_INITA; // apply power to the SD card if appropriate (we use this to send 80 clocks - self-clearing bit)
    #else
        #define POWER_UP_SD_CARD() _CONFIG_PORT_INPUT(A, (SDCARD_DETECT), (PORT_PS_UP_ENABLE)); SDHC_SYSCTL |= SDHC_SYSCTL_INITA; while (SDHC_SYSCTL & SDHC_SYSCTL_INITA) {}; // apply power to the SD card if appropriate (we use this to send 80 clocks)
    #endif
    #define SDHC_SYSCTL_SPEED_SLOW (SDHC_SYSCTL_SDCLKFS_64 | SDHC_SYSCTL_DVS_5) // 375kHz when 120MHz clock
    #define SDHC_SYSCTL_SPEED_FAST (SDHC_SYSCTL_SDCLKFS_2 | SDHC_SYSCTL_DVS_3) // 20MHz when 120MHz clock
    #define SET_SPI_SD_INTERFACE_FULL_SPEED() fnSetSD_clock(SDHC_SYSCTL_SPEED_FAST); SDHC_PROCTL |= SDHC_PROCTL_DTW_4BIT

    #define POWER_DOWN_SD_CARD()                                         // remove power from SD card interface
    #define GET_SDCARD_WP_STATE()   0

    #define SDCARD_DETECTION()     ((_READ_PORT_MASK(A, SDCARD_DETECT)) == 0)// card detection input
    #define PRIORITY_SDCARD_DETECT_PORT_INT   PRIORITY_PORT_A_INT        // port priority when using card detect switch interrupt
    #define SDCARD_DETECT_PORT      PORTA                                // interrupt is on this port
    #define SDCARD_DETECT_PIN       SD_CARD_DETECTION                    // interrupt pin

    #define OWN_SD_CARD_DISPLAY

    #define _DISPLAY_SD_CARD_NOT_PRESENT()
    #define _DISPLAY_SD_CARD_NOT_FORMATTED()
    #define _DISPLAY_NO_FILE()                    _SETBITS(A, (BLUE_LED | RED_LED))
    #define _DISPLAY_SD_CARD_PRESENT()       
    #define _DISPLAY_VALID_CONTENT()         
    #define _DISPLAY_INVALID_CONTENT()            _SETBITS(A, RED_LED)
    #define _DISPLAY_SW_OK()                      _SETBITS(A, BLUE_LED)
    #define _DISPLAY_SW_UPDATED()                 _SETBITS(A, BLUE_LED)
    #define _DISPLAY_ERROR()                      _SETBITS(A, RED_LED)
    #define _DISPLAY_OVERSIZE_CONTENT()           _SETBITS(A, (RED_LED | BLUE_LED))

    #define DEL_USB_SYMBOL()
    #define SET_USB_SYMBOL()
#endif

#if !defined OWN_SD_CARD_DISPLAY                                         // {3}
    #if defined SERIAL_INTERFACE                                         // when UART interface is available
        #if defined USB_MSD_HOST_LOADER
            #define _DISPLAY_SD_CARD_NOT_PRESENT() fnDebugMsg("Mem-Stick not present\r\n")
            #define _DISPLAY_SD_CARD_NOT_FORMATTED() fnDebugMsg("Mem-Stick not formatted\r\n")
            #define _DISPLAY_SD_CARD_PRESENT()    fnDebugMsg("Mem-Stick present\r\n")
            #define _DISPLAY_NO_FILE()            fnDebugMsg("No file on Mem-Stick\r\n")
        #else
            #define _DISPLAY_SD_CARD_NOT_PRESENT() fnDebugMsg("SD-Card not present\r\n")
            #define _DISPLAY_SD_CARD_NOT_FORMATTED() fnDebugMsg("SD-Card not formatted\r\n")
            #define _DISPLAY_SD_CARD_PRESENT()    fnDebugMsg("SD-Card present\r\n")
            #define _DISPLAY_NO_FILE()            fnDebugMsg("No file on card\r\n")
        #endif
        #define _DISPLAY_VALID_CONTENT()          fnDebugMsg("File valid\r\n")
        #define _DISPLAY_INVALID_CONTENT()        fnDebugMsg("File invalid\r\n")
        #define _DISPLAY_SW_OK()                  fnDebugMsg("Software OK\r\n")
        #define _DISPLAY_SW_UPDATED()             fnDebugMsg("Software Updated\r\n")
        #define _DISPLAY_ERROR()                  fnDebugMsg("Update failed\r\n")
        #define _DISPLAY_OVERSIZE_CONTENT()       fnDebugMsg("File oversized!\r\n")
    #else
        #define _DISPLAY_SD_CARD_NOT_PRESENT()   
        #define _DISPLAY_SD_CARD_NOT_FORMATTED() 
        #define _DISPLAY_NO_FILE()               
        #define _DISPLAY_SD_CARD_PRESENT()       
        #define _DISPLAY_VALID_CONTENT()         
        #define _DISPLAY_INVALID_CONTENT()       
        #define _DISPLAY_SW_OK()
        #define _DISPLAY_SW_UPDATED()
        #define _DISPLAY_ERROR()
        #define _DISPLAY_OVERSIZE_CONTENT()
    #endif
#endif


#define _DELETE_BOOT_MAILBOX()     *(BOOT_MAIL_BOX) = 0

#if defined KINETIS_KL                                                   // {5} KL has COP and not watchdog
    #define ACTIVATE_WATCHDOG()    SIM_COPC = (SIM_COPC_COPCLKS_1K | SIM_COPC_COPT_LONGEST) // 1.024s watchdog timeout
#elif defined KINETIS_KE
    #define ACTIVATE_WATCHDOG()    UNLOCK_WDOG(); WDOG_CS2 = (WDOG_CS2_CLK_1kHz | WDOG_CS2_FLG); WDOG_TOVAL = BIG_SHORT_WORD(2000); WDOG_WIN = 0; WDOG_CS1 = (WDOG_CS1_UPDATE | WDOG_CS1_EN); // enable watchdog with 2s timeout (allow updates later if required)
#else
    #define ACTIVATE_WATCHDOG()    UNLOCK_WDOG(); WDOG_TOVALL = (2000/5); WDOG_TOVALH = 0; WDOG_STCTRLH = (WDOG_STCTRLH_ALLOWUPDATE | WDOG_STCTRLH_STNDBYEN | WDOG_STCTRLH_WAITEN | WDOG_STCTRLH_STOPEN | WDOG_STCTRLH_WDOGEN); // watchdog enabled to generate reset on 2s timeout (allow updates later if required)
#endif


#define PORT0_DEFAULT_INPUT        0xffffffff
#define PORT1_DEFAULT_INPUT        0xffffffff
#define PORT2_DEFAULT_INPUT        0xffffffff
#define PORT3_DEFAULT_INPUT        0xffffffff
#define PORT4_DEFAULT_INPUT        0xffffffff
#define PORT5_DEFAULT_INPUT        0xffffffff                            // K70

#if defined KINETIS_KL                                                   // {5} KL doesn't have SIM_SCG1 and SIM_SCG3 registers
    #if defined USB_INTERFACE                                            // disable USB regulator, USB controller module, UARTs and SD card controller, disable peripheral interrupts and clear possible pending
        #define RESET_PERIPHERALS()SYSTICK_CSR = 0; \
                                   POWER_DOWN(4, (SIM_SCGC4_UART0 | SIM_SCGC4_UART1 | SIM_SCGC4_UART2 | SIM_SCGC4_UART3 | SIM_SCGC4_USBOTG)); \
                                   SIM_SOPT1_CLR(SIM_SOPT1_USBREGEN, SIM_SOPT1CFG_URWE); \
                                   IRQ0_31_CER  = 0xffffffff; \
                                   IRQ32_63_CER = 0xffffffff; \
                                   IRQ64_95_CER = 0xffffffff; \
                                   IRQ0_31_CPR  = 0xffffffff; \
                                   IRQ32_63_CPR = 0xffffffff; \
                                   IRQ64_95_CPR = 0xffffffff
    #elif defined KINETIS_KL03                                           // don't disable USB regulator
        #define RESET_PERIPHERALS()SYSTICK_CSR = 0; \
                                   POWER_DOWN(5, (SIM_SCGC5_LPUART0)); \
                                   IRQ0_31_CER  = 0xffffffff; \
                                   IRQ32_63_CER = 0xffffffff; \
                                   IRQ64_95_CER = 0xffffffff; \
                                   IRQ0_31_CPR  = 0xffffffff; \
                                   IRQ32_63_CPR = 0xffffffff; \
                                   IRQ64_95_CPR = 0xffffffff 
    #else                                                                // don't disable USB regulator
        #define RESET_PERIPHERALS()SYSTICK_CSR = 0; \
                                   POWER_DOWN(4, (SIM_SCGC4_UART0 | SIM_SCGC4_UART1 | SIM_SCGC4_UART2 | SIM_SCGC4_UART3)); \
                                   IRQ0_31_CER  = 0xffffffff; \
                                   IRQ32_63_CER = 0xffffffff; \
                                   IRQ64_95_CER = 0xffffffff; \
                                   IRQ0_31_CPR  = 0xffffffff; \
                                   IRQ32_63_CPR = 0xffffffff; \
                                   IRQ64_95_CPR = 0xffffffff 
    #endif
#elif defined KINETIS_KE
        #define RESET_PERIPHERALS()SYSTICK_CSR = 0; \
                                   POWER_DOWN(4, (SIM_SCGC4_UART0 | SIM_SCGC4_UART1 | SIM_SCGC4_UART2)); \
                                   IRQ0_31_CER  = 0xffffffff; \
                                   IRQ32_63_CER = 0xffffffff; \
                                   IRQ64_95_CER = 0xffffffff; \
                                   IRQ0_31_CPR  = 0xffffffff; \
                                   IRQ32_63_CPR = 0xffffffff; \
                                   IRQ64_95_CPR = 0xffffffff 
#else
    #if defined USB_INTERFACE                                            // disable USB regulator, USB controller module, UARTs and SD card controller, disable peripheral interrupts and clear possible pending
        #define RESET_PERIPHERALS()SYSTICK_CSR = 0; \
                                   POWER_DOWN(4, (SIM_SCGC4_UART0 | SIM_SCGC4_UART1 | SIM_SCGC4_UART2 | SIM_SCGC4_UART3 | SIM_SCGC4_USBOTG)); \
                                   POWER_DOWN(1, (SIM_SCGC1_UART4 | SIM_SCGC1_UART5)); \
                                   POWER_DOWN(2, SIM_SCGC2_ENET); \
                                   POWER_DOWN(3, (SIM_SCGC3_SDHC | SIM_SCGC3_USBHS | SIM_SCGC3_USBHSPHY)); \
                                   SIM_SOPT1_CLR(SIM_SOPT1_USBREGEN, SIM_SOPT1CFG_URWE); \
                                   IRQ0_31_CER  = 0xffffffff; \
                                   IRQ32_63_CER = 0xffffffff; \
                                   IRQ64_95_CER = 0xffffffff; \
                                   IRQ0_31_CPR  = 0xffffffff; \
                                   IRQ32_63_CPR = 0xffffffff; \
                                   IRQ64_95_CPR = 0xffffffff
    #else                                                                // don't disable USB regulator
        #define RESET_PERIPHERALS()SYSTICK_CSR = 0; \
                                   POWER_DOWN(4, (SIM_SCGC4_UART0 | SIM_SCGC4_UART1 | SIM_SCGC4_UART2 | SIM_SCGC4_UART3)); \
                                   POWER_DOWN(1, (SIM_SCGC1_UART4 | SIM_SCGC1_UART5)); \
                                   POWER_DOWN(2, SIM_SCGC2_ENET); \
                                   POWER_DOWN(3, (SIM_SCGC3_SDHC)); \
                                   IRQ0_31_CER  = 0xffffffff; \
                                   IRQ32_63_CER = 0xffffffff; \
                                   IRQ64_95_CER = 0xffffffff; \
                                   IRQ0_31_CPR  = 0xffffffff; \
                                   IRQ32_63_CPR = 0xffffffff; \
                                   IRQ64_95_CPR = 0xffffffff 
    #endif
#endif




