uTasker/uTasker-Kinetis/Applications/uTaskerSerialBoot/app_hw_kinetis.h
// LAN interface
//
#if defined ETH_INTERFACE                                                // {10}
    #define NUMBER_OF_TX_BUFFERS_IN_ETHERNET_DEVICE         2            // allocate 2 buffers for transmission
    #define NUMBER_OF_RX_BUFFERS_IN_ETHERNET_DEVICE         6            // allocate 6 (full) buffers for reception
    //#define USE_MULTIPLE_BUFFERS                                       // construct the receive buffer space using multiple 256 byte buffers (improved overrun performance for total memory requirement but reduced efficiency due to extra copy)

    #define IP_RX_CHECKSUM_OFFLOAD                                       // allow the HW to perform IPv4/v6 UDP, TCP and ICMP checksum verification so that no such calculation is required in code
    #define IP_TX_CHECKSUM_OFFLOAD                                       // allow the HW to insert IPv4/v6 header checksum and so the software doesn't need to calculate and insert this
    #define IP_TX_PAYLOAD_CHECKSUM_OFFLOAD                               // allow the HW to insert IPv4/v6 payload checksum and so the software doesn't need to calculate and insert this

    #define FORCE_PAYLOAD_ICMPV6_TX                                      // calculate value since the automatic offloading doesn't do it
    #define FORCE_PAYLOAD_ICMPV6_RX                                      // perform checksum in software since the automatic offloading doesn't do it

    #ifdef USE_BUFFERED_TCP                                              // if using a buffer for TCP to allow interractive data applications (like TELNET)
        #define TCP_BUFFER            2800                               // size of TCP buffer (with USE_BUFFERED_TCP) - generous with Kinetis
        #define TCP_BUFFER_FRAME      1400                               // allow this max. TCP frame size
    #endif

    #ifdef USE_HTTP
        #define HTTP_BUFFER_LENGTH    1400                               // we send frames with this maximum amount of payload data - generous with Kinetis
    #endif


  //#define LAN_REPORT_ACTIVITY                                          // transmissions/receptions and errors are reported to chosen task (for link LED control, etc)
    #if defined LAN_REPORT_ACTIVITY
            #define ACTIVITY_LED_OFF()     
            #define ACTIVITY_LED_ON()      
            #define TURN_LINK_LED_ON()     
            #define SPEED_LED_ON()         
            #define SPEED_LED_OFF()        
            #define LINK_DOWN_LEDS()       

            #define CONFIGURE_LAN_LEDS()
    #endif

    #if defined USE_IP
        #define LAN_BUFFER_SIZE        1514                              // Kinetis has ample space for full IP payload (if VLAN is enabled the size is automatically adjusted to allow tags)
    #else
        #define LAN_BUFFER_SIZE        256                               // if using Ethernet without IP the buffer size can be set here
    #endif

    #define PHY_MASK                   0xfffffff0                        // don't check the revision number

    #if defined TWR_K60F120M || defined TWR_K60N512 || defined TWR_K60D100M || defined TWR_K70F120M || defined TWR_K53N512 || defined K60F150M_50M || defined TWR_K65F180M
      //#define JTAG_DEBUG_IN_USE_ERRATA_2541                            // pull the optional MII0_RXER line down to 0V to avoid disturbing JTAG_TRST - not needed when using SWD for debugging 
        #if defined TWR_K65F180M
            #define ETHERNET_RMII_CLOCK_INPUT                            // the ENET_1588_CLKIN is used as clock since a 50MHz PHY clock is not available on EXTAL
        #endif
        #if defined K60F150M_50M
            #define ETHERNET_RMII                                        // RMII mode of operation instead of MII
            #define FORCE_PHY_CONFIG                                     // activate forced configuration
            #define POLL_PHY               10000                         // PHY detection is unreliable on this board so allow this many attempts
            #define FNFORCE_PHY_CONFIG()   
            #define PHY_ADDRESS            0x01                          // address of external PHY on board
            #define SUPPORT_PORT_INTERRUPTS                              // enable port interrupts
            #define PHY_INTERRUPT_PORT     PORTB
            #define PHY_INTERRUPT          PORTB_BIT7                    // IRQ4 is used as PHY interrupt input (set J6 to position 7-8 on TWR-SER board) - this is connected to PB.7
            #define PHY_IDENTIFIER         0x00221550                    // MICREL KSZ8051RNL identifier
            #define RESET_PHY
            #define ASSERT_PHY_RST()
            #define CONFIG_PHY_STRAPS()    _CONFIG_DRIVE_PORT_OUTPUT_VALUE_FAST_LOW(B, PORTB_BIT9, 0, (PORT_SRE_SLOW | PORT_DSE_LOW))
            #define FNRESETPHY()           _SETBITS(B, PORTB_BIT9); fnDelayLoop(1000)
            #define _KSZ8081RNA                                          // use compatible register set
        #elif defined TWR_SER2                                           // {17}
            #define ETHERNET_RMII                                        // RMII mode of operation instead of MII
            #define PHY_POLL_LINK                                        // poll the link status since there is no interrupt connected
            #define INTERRUPT_TASK_PHY     TASK_NETWORK_INDICATOR        // link status reported to this task (do not use together with LAN_REPORT_ACTIVITY)

            #define PHY_ADDRESS            0x00                          // address of external PHY on board - channel A (channel B is 0x01)
            #define FNRESETPHY()
            #define PHY_IDENTIFIER         0x20005ca2                    // National/TI DP83849I identifier
            #define _DP83849I
        #else                                                            // TWR SER board
            #define ETHERNET_RMII                                        // RMII mode of operation instead of MII
            #define FORCE_PHY_CONFIG                                     // activate forced configuration
            #define FNFORCE_PHY_CONFIG()   
            #if defined TWR_K65F180M
                #define INTERRUPT_TASK_PHY     TASK_NETWORK_INDICATOR    // link status reported to this task (do not use together with LAN_REPORT_ACTIVITY)
                #define PHY_ADDRESS            0x00                      // address of external PHY on board
                #define PHY_INTERRUPT_PORT     PORTE
                #define PHY_INTERRUPT          PORTE_BIT28               // IRQ1 is used as PHY interrupt input (set J6 to position 7-8 on TWR-SER board) - this is connected to PTD15
                #define ETHERNET_MDIO_WITH_PULLUPS                       // there is no pull-up on the tower board so enable one at the MDIO input
            #else
                #define POLL_PHY               10000                     // PHY detection is unreliable on this board so allow this many attempts
                #define PHY_ADDRESS            0x01                      // address of external PHY on board
              //#define PHY_INTERRUPT_PORT     PORTB
              //#define PHY_INTERRUPT          PORTB_BIT7                // IRQ4 is used as PHY interrupt input (set J6 to position 7-8 on TWR-SER board) - this is connected to PB.7
                #define PHY_IDENTIFIER         0x00221512                // MICREL KSZ8041NL identifier
                #define FNRESETPHY()
                #if defined TWR_K53N512                                  // this tower board has a port output controlling the reset line on the elevator - it is set to an output driving '1' to avoid the PHY being held in reset
                    #define RESET_PHY
                    #define ASSERT_PHY_RST() _CONFIG_DRIVE_PORT_OUTPUT_VALUE_FAST_LOW(C, (RESETOUT), (RESETOUT), (PORT_SRE_SLOW | PORT_DSE_LOW))
                    #define CONFIG_PHY_STRAPS()                          // dummy
                #endif
            #endif
        #endif
        #if defined K60F150M_50M
            #define MII_MANAGEMENT_CLOCK_SPEED   2500000                 // 2.5MHz
        #else
            #if SYSTEM_CLOCK > 100000000
                #define MII_MANAGEMENT_CLOCK_SPEED   1000000             // reduced speed due to weak data line pull up resistor and long back-plane distance (warning - too low results in a divider overflow in MSCR)
            #else
                #define MII_MANAGEMENT_CLOCK_SPEED   800000              // reduced speed due to weak data line pull up resistor and long back-plane distance (warning - too low results in a divider overflow in MSCR)
            #endif
        #endif
    #elif defined FRDM_K64F && !defined NO_INTERNAL_ETHERNET
        #define ETHERNET_RMII                                            // RMII mode of operation instead of MII
        #define FORCE_PHY_CONFIG                                         // activate forced configuration
        #define FNFORCE_PHY_CONFIG()   
        #define PHY_ADDRESS            0x00                              // address of external PHY on board
        #define PHY_IDENTIFIER         0x00221560                        // MICREL KSZ8081RNA identifier
        #define FNRESETPHY()
        #define MII_MANAGEMENT_CLOCK_SPEED    2500000                    // typ. 2.5MHz Speed
        #define ETHERNET_MDIO_WITH_PULLUPS                               // there is no pull-up on the FRDM board so enable one at the MDIO input
        #define PHY_POLL_LINK                                            // no interrupt line connected so poll the link state
        #define INTERRUPT_TASK_PHY     TASK_NETWORK_INDICATOR            // enable link state output messages
        #define _KSZ8081RNA
    #elif defined TWR_K64F120M                                           // for ethernet operation the clock settings must be J32-ON (and J33-OFF)
        #define ETHERNET_RMII                                            // RMII mode of operation instead of MII
        #define FORCE_PHY_CONFIG                                         // activate forced configuration
      //#define POLL_PHY               10000                             // PHY detection is unreliable on this board so allow this many attempts
        #define FNFORCE_PHY_CONFIG()   
        #define PHY_ADDRESS            0x00                              // address of external PHY on board
        #define PHY_INTERRUPT_PORT     PORTD
        #define PHY_INTERRUPT          PORTD_BIT15                       // IRQ1 is used as PHY interrupt input (set J6 to position 7-8 on TWR-SER board) - this is connected to PTD15
        #define SUPPORT_PORT_INTERRUPTS                                  // enable port interrupts
        #define PHY_IDENTIFIER         0x00221512                        // MICREL KSZ8041NL identifier
        #define FNRESETPHY()
        #define MII_MANAGEMENT_CLOCK_SPEED    2500000                    // typ. 2,5MHz Speed
        #define ETHERNET_MDIO_WITH_PULLUPS                               // there is no pull-up on the board so enable one at the MDIO input

        // Internal HTML message pages
        //
        #define SUPPORT_INTERNAL_HTML_FILES                              // enable the use of files from code
    #endif
#endif

#if defined SPI_FLASH_ST                                                 // ST SPI FLASH used
  //#define SPI_FLASH_STM25P05                                           // the available ST chips
  //#define SPI_FLASH_STM25P10
  //#define SPI_FLASH_STM25P20
  //#define SPI_FLASH_STM25P40
  //#define SPI_FLASH_STM25P80                                               
  //#define SPI_FLASH_STM25P16                                               
  //#define SPI_FLASH_STM25P32                                               
    #define SPI_FLASH_STM25P64
  //#define SPI_FLASH_STM25P128

    #if defined SPI_FLASH_STM25P05                                       // 64k
        #define SPI_FLASH_PAGES             (1 * 256)                          
    #elif defined SPI_FLASH_STM25P10                                     // 128k
        #define SPI_FLASH_PAGES             (2 * 256)
    #elif defined SPI_FLASH_STM25P20                                     // 256k
        #define SPI_FLASH_PAGES             (4 * 256)
    #elif defined SPI_FLASH_STM25P40                                     // 512k
        #define SPI_FLASH_PAGES             (8 * 256)
    #elif defined SPI_FLASH_STM25P80                                     // 1M
        #define SPI_FLASH_PAGES             (16 * 256)
    #elif defined SPI_FLASH_STM25P16                                     // 2M
        #define SPI_FLASH_PAGES             (32 * 256)
    #elif defined SPI_FLASH_STM25P32                                     // 4M
        #define SPI_FLASH_PAGES             (64 * 256)
    #elif defined SPI_FLASH_STM25P64                                     // 8M
        #define SPI_FLASH_PAGES             (128 * 256)
    #elif defined SPI_FLASH_STM25P128                                    // 16M
        #define SPI_FLASH_PAGES             (256 * 256)
    #endif
    #define SPI_FLASH_PAGE_LENGTH 256
    #if defined SPI_DATA_FLASH
        #define SPI_FLASH_SECTOR_LENGTH (16 * SPI_FLASH_PAGE_LENGTH)     // sub-sector size of data FLASH
    #else
        #define SPI_FLASH_SECTOR_LENGTH (256 * SPI_FLASH_PAGE_LENGTH)    // sector size of code FLASH
    #endif
    #define SPI_FLASH_BLOCK_LENGTH  SPI_FLASH_SECTOR_LENGTH
#elif defined SPI_FLASH_SST25
  //#define SPI_FLASH_SST25VF010A                                        // the supported SST chips
  //#define SPI_FLASH_SST25LF020A
  //#define SPI_FLASH_SST25LF040A
    #define SPI_FLASH_SST25VF040B
  //#define SPI_FLASH_SST25VF080B
  //#define SPI_FLASH_SST25VF016B
  //#define SPI_FLASH_SST25VF032B

    #if defined SPI_FLASH_SST25VF010A                                    // 1Mbit (128k)
        #define SST25_A_VERSION
        #define SPI_FLASH_PAGES             (32)
    #elif defined SPI_FLASH_SST25LF020A                                  // 2Mbit (256k)
        #define SST25_A_VERSION
        #define SPI_FLASH_PAGES             (64)
    #elif defined SPI_FLASH_SST25LF040A                                  // 4Mbit (512k)
        #define SST25_A_VERSION
        #define SPI_FLASH_PAGES             (128)
    #elif defined SPI_FLASH_SST25VF040B                                  // 4Mbit (512k)
        #define SPI_FLASH_PAGES             (128)
    #elif defined SPI_FLASH_SST25VF080B                                  // 8Mbit (1M)
        #define SPI_FLASH_PAGES             (256)
    #elif defined SPI_FLASH_SST25VF016B                                  // 16Mbit (2M)
        #define SPI_FLASH_PAGES             (512)
    #elif defined SPI_FLASH_SST25VF032B                                  // 32Mbit (4M)
        #define SPI_FLASH_PAGES             (1024)
    #endif

